### Import Necessary Modules Required for EDA

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv('data.csv', encoding='ISO-8859-1')

In [4]:
df.head()

,EEID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date
0,E02387,Emily Davis,Sr. Manger,IT,Research & Development,Female,Black,55,4/8/2016,"$141,604",15%,United States,Seattle,10/16/2021
1,E04105,Theodore Dinh,Technical Architect,IT,Manufacturing,Male,Asian,59,11/29/1997,"$99,975",0%,China,Chongqing,NaN
2,E02572,Luna Sanders,Director,Finance,Speciality Products,Female,Caucasian,50,10/26/2006,"$163,099",20%,United States,Chicago,NaN
3,E02832,Penelope Jordan,Computer Systems Manager,IT,Manufacturing,Female,Caucasian,26,9/27/2019,"$84,913",7%,United States,Chicago,NaN
4,E01639,Austin Vo,Sr. Analyst,Finance,Manufacturing,Male,Asian,55,11/20/1995,"$95,409",0%,United States,Phoenix,NaN

In [5]:
df.dtypes

EEID             object
Full Name        object
Job Title        object
Department       object
Business Unit    object
Gender           object
Ethnicity        object
Age               int64
Hire Date        object
Annual Salary    object
Bonus %          object
Country          object
City             object
Exit Date        object
dtype: object

In [6]:
df.columns

Index(['EEID', 'Full Name', 'Job Title', 'Department', 'Business Unit',
       'Gender', 'Ethnicity', 'Age', 'Hire Date', 'Annual Salary', 'Bonus %',
       'Country', 'City', 'Exit Date'],
      dtype='object')

In [7]:
columns = df.columns
columns = columns.str.replace(' ','_')
columns = columns.str.replace('Bonus_%','Bonus')
columns = columns.str.lower()
columns

Index(['eeid', 'full_name', 'job_title', 'department', 'business_unit',
       'gender', 'ethnicity', 'age', 'hire_date', 'annual_salary', 'bonus',
       'country', 'city', 'exit_date'],
      dtype='object')

In [8]:
rename_dict = dict(zip(df.columns, columns))
df.rename(columns=rename_dict, inplace = True)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   eeid           1000 non-null   object
 1   full_name      1000 non-null   object
 2   job_title      1000 non-null   object
 3   department     1000 non-null   object
 4   business_unit  1000 non-null   object
 5   gender         1000 non-null   object
 6   ethnicity      1000 non-null   object
 7   age            1000 non-null   int64
 8   hire_date      1000 non-null   datetime64[ns]
 9   annual_salary  1000 non-null   int64
 10  bonus          1000 non-null   object
 11  country        1000 non-null   object
 12  city           1000 non-null   object
 13  exit_date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), int64(2), object(10)
memory usage: 109.5+ KB

In [21]:
df.drop(columns='exit_date', inplace=True)

In [11]:
df['annual_salary'] = df['annual_salary'].str.replace('$', '')
df['annual_salary'] = df['annual_salary'].str.replace(',', '')
df['annual_salary'] = pd.to_numeric(df['annual_salary'])

In [24]:
df['bonus'] = df['bonus'].str.replace('%', '')
df['bonus'] = pd.to_numeric(df['bonus'])
df['bonus'] = df['bonus']*0.01

In [25]:
df['hire_date'] = pd.to_datetime(df['hire_date'])

In [26]:
df.dtypes

eeid                     object
full_name                object
job_title                object
department               object
business_unit            object
gender                   object
ethnicity                object
age                       int64
hire_date        datetime64[ns]
annual_salary             int64
bonus                   float64
country                  object
city                     object
dtype: object

In [27]:
df.describe()

               age                   hire_date  annual_salary        bonus
count  1000.000000                        1000    1000.000000  1000.000000
mean     44.382000  2012-04-07 02:54:14.400000  113217.365000     0.088660
min      25.000000         1992-01-09 00:00:00   40063.000000     0.000000
25%      35.000000         2007-02-14 00:00:00   71430.250000     0.000000
50%      45.000000         2014-02-15 12:00:00   96557.000000     0.000000
75%      54.000000         2018-06-22 00:00:00  150782.250000     0.150000
max      65.000000         2021-12-26 00:00:00  258498.000000     0.400000
std      11.246981                         NaN   53545.985644     0.117856

In [29]:
from sqlalchemy import create_engine

In [30]:
engine = create_engine('postgresql://postgres:kaen@localhost:5432/postgres')

In [33]:
df.to_sql('employees', con=engine.connect() , index=False, if_exists = 'replace')

1000